coport-uni/Esp32S3-CrawlerDisplay/sdkconfig.defaults
# 칩 타깃
CONFIG_IDF_TARGET="esp32s3"

# 16MB 플래시
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Octal PSRAM (BOX-3는 16MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# CPU 클럭 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# LVGL 더블 버퍼링용 메모리
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y

# USB-Serial JTAG 콘솔
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y